Revit 2027 API
ParameterTypeId.AnalyticalModelArea Property
 "Area": The Area of Analytical Model
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelArea { get; }
Public Shared ReadOnly Property AnalyticalModelArea As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelArea {
	ForgeTypeId^ get ();
}
static member AnalyticalModelArea : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace